<template>
    <div>
        <v-header></v-header>
        <div class="main-content">
            <h3>主要内容</h3>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
            <h2>a三顿饭啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊</h2>
        </div>
        <v-footer></v-footer>
    </div>



</template>

<script>
    import header from "../components/public/header.vue";
	import footer from "../components/public/footer.vue";
	export default {
        components: {
        	"v-header": header,
			"v-footer": footer
        },
		data () {
			return {
			}
		}
	}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
    .main-content {
        padding: 45px 15px;
        overflow: scroll;
        z-index: 1;
    }
</style>
